Revit 2027 API
ModelPathUtils.ConvertModelPathToUserVisiblePath Method
 Gets a string version of the path of a given ModelPath.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string ConvertModelPathToUserVisiblePath(
	ModelPath path
)
Public Shared Function ConvertModelPathToUserVisiblePath (
	path As ModelPath
) As String
public:
static String^ ConvertModelPathToUserVisiblePath(
	ModelPath^ path
)
static member ConvertModelPathToUserVisiblePath :
        path : ModelPath -> string
Parameters
path ModelPath
 A ModelPath representing a file path or a server path.
Return Value
String
 The path in string form
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ModelPathUtils Class
Autodesk.Revit.DB Namespace